oc-ece-mesa/mesa-basalt/arduino-ide-board/variant.h
#pragma once

#define PINS_COUNT 11u
#define NUM_DIGITAL_PINS 11u
#define NUM_ANALOG_INPUTS 8u

// TODO, below
#define analogInputToDigitalPin(p)

#define PIN_SERIAL_RX
#define PIN_SERIAL_TX

#define PIN_SPI_SS
#define PIN_SPI_MOSI
#define PIN_SPI_MISO
#define PIN_SPI_SCK

#define PIN_WIRE_SDA
#define PIN_WIRE_SCL
